# Exercise 9

###  The objective of this assignment is to use Pandas library to analyze data from San Francisco Salaries
The questions are ordered by difficulty level

1. a. Import the pandas library
<br>
   b. Read the file from https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv into a pandas dataframe. 
   Notice: you can read the file directly from the link

2. Print the first 5 rows of the dataframe

In [5]:
import pandas as pd
salas = pd.read_csv("https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv") # you can specify parse_dates=["Year"]

C:\Users\Gidi\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [6]:
salas.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [3]:
# Do not run this cell. This is the desired output for references

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

3. Find out how many entries are there. Which columns contains null values? Make sure you understand what the columns hold

In [7]:
salas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [4]:
# Do not run this cell. This is the desired output for references

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

4. Change columns that should be numeric but are currently objects:
<br>
Use pd.to_numeric(your column). 
Add the paramenter errors='coerce' to change errors (that is, text that cannot be transformed to a number to nan).
<br>
For example df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')

In [15]:
salas["BasePay"] = pd.to_numeric(salas["BasePay"], errors='coerce')
salas["OtherPay"] = pd.to_numeric(salas["OtherPay"], errors='coerce')
salas["OvertimePay"] = pd.to_numeric(salas["OvertimePay"], errors='coerce')
salas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(6), int64(2), object(5)
memory usage: 14.7+ MB

5. What is the average base pay (of the column BasePay)?

In [17]:
salas["BasePay"].describe()["mean"]

66325.44884050643

In [26]:
# Do not run this cell. this is the Desire output for refernces

66325.44884050643

6. What is the highest amount of overtime pay in the dataset?

In [20]:
salas["OvertimePay"].describe()[-1]

245131.88

In [96]:
# Do not run this cell. this is the Desire output for refernces

245131.88

7. How many unique names of employees are there? (including upper/lower case)

In [21]:
salas["EmployeeName"].nunique()

110811

In [25]:
# Do not run this cell. this is the Desire output for refernces

110811

8. What is the job title of WYLIE TIMMERMAN?

In [27]:
wylie = salas.loc[salas["EmployeeName"]=="WYLIE TIMMERMAN"]
wylie["JobTitle"]

29987    PUBLIC SERVICE TRAINEE
Name: JobTitle, dtype: object

In [34]:
# Do not run this cell. this is the Desire output for refernces

29987    PUBLIC SERVICE TRAINEE
Name: JobTitle, dtype: object

9. How much JOSEPH DRISCOLL makes (including benefits)?

In [35]:
salas.loc[salas["EmployeeName"]=="JOSEPH DRISCOLL"]["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [3]:
# Do not run this cell. this is the Desire output for refernces

24    270324.91
Name: TotalPayBenefits, dtype: float64

10. What was the lowest salary (including benefits) in the year of 2013?
<br>
Use .loc to extract all rows when year is equeal to 2013 and call the .min() method on the appropriate column

In [50]:
sa13 = salas.loc[salas["Year"]==2013]
sa13.min()["TotalPayBenefits"]

-33.89

In [12]:
# Do not run this cell. this is the Desire output for refernces

-33.89

11. What is the name and title of the highest paid person? (including benefits)
<br>
** Hint: use .max() method on the relevant column

In [58]:
salas.nlargest(n=1, columns="TotalPayBenefits")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [29]:
# Do not run this cell. this is the Desire output for refernces

     EmployeeName                                        JobTitle
0  NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY